[{"path":"/blogs/the-newsletter-archive/cracking-the-sock-code","heading":"Cracking the Sock Code","cardText":"What is Linus if not the tech tip man, the socks and sandals man, and the dropper of all things. With that reputation, as well as our amazing products on...","date":"May 19, 2023","imgURL":"https://www.lttstore.com/cdn/shop/articles/socks.jpg","contents":[{"type":"text","data":"What is Linus if not the tech tip man, the socks and sandals man, and the dropper of all things. With that reputation, as well as our amazing products on lttstore, people always ask… why the heck do you not have an LTT Sock??"},{"type":"text","data":"Well… honestly, at this point it feels like designing a rocket for Elon’s Mars trip might be simpler than designing the perfect socks for Mr. Socks and Sandals. We’ve got the perfect screwdriver, the perfect backpack (once we get those carabiner replacements sent out - stay tuned for info on that soon!), and the almost perfect mousepad. Why are socks so difficult to get right? It’s just socks!"},{"type":"text","data":"Let's face it, a lot of socks on the market are simply not up to par. They fall apart after just a few washes, leaving you with a sad and holey sock drawer. That's why it's crucial to develop socks that can withstand the wear and tear of daily use without leaving your feet in a sweaty swamp either."},{"type":"text","data":"We've been on a quest for the past two years to create socks that can replace Linus’ almighty Darn Tough socks. You know, the ones that are made with a high-quality nylon/wool spandex blend and are tougher than nails - and with a limited lifetime warranty to boot. He wears them every day. To be clear, not the same pair every day…we hope… We've connected with a bunch of vendors and created a bin full of samples, but still no luck. It's like we're trying to replicate the secret formula for Coca-Cola or something."},{"type":"text","data":"The yarn we get from our vendors is close, but not quite there. To be fair, we are being picky with our sample requirements. We're talking about needing 12 different knits on different areas of the sock to get our target durability and quality, and we want socks that are thick enough on the toes and heels for max comfort. It’s important that the heel and toes have thick material because that’s where they see the most wear and tear. But we need thinner sections on the top and arch of the foot to maximize breathability and mobility. Apparently that's like asking for a miracle."},{"type":"image","data":"https://cdn.shopify.com/s/files/1/0058/4538/5314/files/black_socks_480x480.jpg"},{"type":"text","data":"The vendors we're working with can't recreate that perfect ratio of thick and thin within the construction of the sock, and the stretchiness is always too much. Oh god, the stretch factor! We don't want socks that stretch like a rubber band. We want them to fit snug and not slip off while Linus plays his weekly games of badminton, or if he ever needs to run from a bear - let’s be real, one meal for that bear would take away a whole lot of meals for a whole lot of humans these days. Too much stretch can also cause further wear and tear on the socks, and nobody has time for that."},{"type":"text","data":"We've experimented with adding grips to the socks to help with the snug fit, but that brings in its own challenges like catching on your boots or shoes every time you put them on. It's a catch-22. Beyond that, adding grips to the socks won't necessarily solve the problem of stretchiness and fit, AND grips made of plastic won't last long post laundry day after being exposed to the heat from the dryer. So we're still brainstorming ways to improve the construction and materials to make the socks as durable and comfortable as possible."},{"type":"image","data":"https://cdn.shopify.com/s/files/1/0058/4538/5314/files/socks_480x480.jpg"},{"type":"text","data":"We've got to figure out the material too. The weight of the cotton, wool or polyester plays a big role in the durability of socks. And don't even get us started on breathability. We need to use natural fibers for that. So yeah, building socks for Linus is like trying to solve a Rubik's Cube blindfolded. But we won't stop until we find the perfect pair. We’re Team Goldie Socks, and we’re on a mission looking for a pair that feels jussst riiight."},{"type":"image","data":"https://cdn.shopify.com/s/files/1/0058/4538/5314/files/IMG_9722_d67ad113-eb4c-4e79-b1ab-1f83ffcdf68c_600x600.jpg"},{"type":"text","data":"Once we’re able to reach that incredibly high quality standard that we have set up for ourselves, we'll move on to perfecting the fit and creating cool designs. The kind of socks you’d be proud to show off too. We know that a sock can have all the durability and quality in the world, but if it doesn't fit right, it's still a bad sock. That's why we're committed to not only finding the right materials and construction techniques, but also making sure that the socks fit like a glove - regardless of your weird, oversized toe."},{"type":"text","data":"We're talking about a sock that hugs your foot in all the right places, with no bunching, slipping, or sliding. A sock that feels like it was custom-made just for you, so you want it to last! It's a tall order, but we're up for the challenge. Because at the end of the day, we believe that everyone deserves a damn good sock. So we’ll keep working away and keep you posted."},{"type":"text","data":"Until then… Why did the sock go to the doctor? Because it had a hole in its sole!"},{"type":"text","data":"------------------------------------------------------------------------"},{"type":"text","data":"In the meantime…we do have some pretty amazing hoodies on lttstore.com, so while you’re keeping your feet warm with the heat of that beautiful new GPU in your PC, waiting for these socks to come along… at least keep your arms warm with a WAN Hoodie! Check it out on\nlttstore.com."}]},{"path":"/blogs/the-newsletter-archive/the-magnetism-between-us-is-undeniable","heading":"The magnetism between us is undeniable","cardText":"As I'm sure you've already seen, we finally launched the LTT Screwdriver! It slices! It dices! Well... no, it doesn't slice, or dice. But it does screw, drive, and in...","date":"October 14, 2022","imgURL":"https://www.lttstore.com/cdn/shop/articles/unnamed_38d23ed8-857d-4fa8-a9c7-021791980d14.png","contents":[{"type":"text","data":"As I'm sure you've already seen, we finally launched the LTT Screwdriver!\nIt slices! It dices! Well... no, it doesn't slice, or dice. But it does screw, drive, and in addition to looking flippin awesome, it has a darn strong magnet in the shaft.\nTo give you some background on why that magnet is so important, welcome the man, the myth, the legend, who FINALLY released a product - Kyle."},{"type":"text","data":"Kyle Tharratt\nTotally Magnetised Engineering Manager"},{"type":"text","data":"First off…. We want to thank the community for the amazing launch of the LTT screwdriver. Finally! lttstore engineering has released a product. But what is a product if not just a vehicle to deliver magnets to the world?\nSome people have asked why we needed to include a broach magnet... and well, the simplest answer is just that Linus wanted one. The end!\nMy more serious answer is that - for the expected use case of a lot of our buyers - a broach magnet in the shaft of your daily screwdriver is almost a necessity. If you're fiddling with computers, or working in small spaces, a magnetised bit can be an absolute life saver. Just look at how many screws this thing can pick up."},{"type":"image","data":"https://ci4.googleusercontent.com/proxy/jZtFsTZgrM0krSYi2tgcfFF_gVwZ9R-RnoTsA-fHNRFc0xdGOqoPrQd9pQnDYVnRBjlqzOB-ZLXyVK4dsRYAY1jwpb8bys_bxw_TarP66vryDlhROqALLnvWLn92LQVsrtOISP8P5uUNDHaMTl_qC5nEGzmiaJop6JnzVAz2vvwGGkeVaoVLOw71uy0Tx9WHFkKXLMR9S61tYYZzJDTP_Mxmogo=s0-d-e1-ft#https://cdn.shopify.com/shopify-email/variants/uo0qixisk4dbw3pslomz9f0b1iz6/f7f6c80e61690d71746c721bd14efbc0557e6839079f6b6fe3dab81b3c2bfb61.png"},{"type":"text","data":"As with all design decisions, there are pros and cons to this implementation. One con is that including a broach magnet means that you basically give up on double-ended bits. We didn't consider that to be much of a sacrifice in our primary industry, but it is still a trade-off. The biggest pro is obviously that sweet, sweet grabbing force. Drop a screw in a case behind a PSU shroud or under a bunch of annoyingly placed cables? Just feel too lazy to grab it by hand? We got you covered. It may seem like a small thing if you've never used one, but we think the convenience will surprise you.\nPicking the right magnet was also an important factor in development... the main contributors to magnet force are fairly simple - size and quality. We use N52 neodymium, so the quality is there. With size, we did the best we could with what we had available. Our 9.44mm diameter shaft is a restriction on magnet size, but we were still able to fit a 6mm diameter cylindrical ring, which is also 6mm long - while still maintaining enough wall thickness in the shaft to support as much torque as anyone should be able to put through it with their bare hands with normal use. It's not quite as powerful as what you'll find in the PB Swiss (pictured below in Project Farm's awesome comparison video!), but we find our thinner shaft to be much more usable in an environment like a PC case."},{"type":"image","data":"https://ci5.googleusercontent.com/proxy/_ct-NbKvLnRbeAY1s35p54oJLgpG41TPf_W1JDs5KX0I9XLuz80WFO8H4bvZmRn7BMcCIjEbzoMVf3zLgtDnyRyR6pUxRQL2qxdgiETmZ0KrbYxcPcy8Lii8pELCGiif0uqCeM0PWJaiqx3ALfrqOwQJ8uvHUlzTtJuKmy1-WiTGYm4XIIwlDAFTtqJSAaLm5Jur3MR8WLHcFPabQjiIBzGaUl0=s0-d-e1-ft#https://cdn.shopify.com/shopify-email/variants/iu3snrpp4unkspy5gnin1y8nmr73/f7f6c80e61690d71746c721bd14efbc0557e6839079f6b6fe3dab81b3c2bfb61.png"},{"type":"text","data":"Project Farm created an awesome head to head showdown of a bunch of ratcheting drivers back in early September. If you haven't checked out that video, we highly recommend that you do!\nhttps://youtu.be/845HUaWYSQA"},{"type":"text","data":"And of course, if for whatever reason our broach magnet isn't sufficient for your needs, we do include our 6x6 \"Screw Retriever\" magnet bit for more direct access to that magnetism. I originally fought Linus pretty hard on this one - he thought it was a necessity, and I felt like it was a waste of 1/12th of your bit storage when you already have a broach magnet. I hate to say it, but this was a massive L for me. This thing is AWESOME, and I find myself reaching for it for way more than I ever imagined I would. Heck, it even holds up the whole screwdriver as a fun party trick."},{"type":"image","data":"https://ci5.googleusercontent.com/proxy/MJ55T0_3ZMlTnynlFSJmHPUC3JLp7Toxz7EhxXqOFdRWfs214f1Qy9AhxG_9zbuMvqYVyIRZONFy-Pn1LPWqpfSC6pTEW1_Y6U26Moq71IgQmT4j8oUC_UDigAU0I5XNRU-eRXCv-inHXOXmhHIoakAREFRr8IlYxmx-XdUY2TYRjyUi2nY22uXGJt1eltigd5Y02Ccx_PZ_kGfrRWRChcYoAbE=s0-d-e1-ft#https://cdn.shopify.com/shopify-email/variants/o5psj1lu8zzlx4wxhsb5ttdqk79o/b281069fdc5f2d087de66ac62d32ade425a1d357c37b73250f646ccf0087e1a4.jpg"},{"type":"text","data":"So, if you're asking \"why on earth did they include a magent in this thing...\" all I can say is, give it a try for yourself and we're sure you'll understand."},{"type":"text","data":"Speaking of trying it for yourself, we do have some good news. LTT Screwdrivers have started shipping a little early, so some wave 1 & 2 buyers should have them in hand soon!\nWe've also got a ton of Fall/Winter clothing available, from hoodies, swacket, beanies, and more on lttstore right now, so be sure to check those out if you haven't already.\nThanks and speak with ya again soon!"},{"type":"text","data":"Nick\nCOO\nlttstore.com / Creator Warehouse\n@nicklmg"}]},{"path":"/blogs/the-newsletter-archive/we-hear-you","heading":"We hear you...","cardText":"Before we jump in on today's topic, I want to quickly follow up on last week's hotly debated \"screwdriver color\" conversation. Some of y'all got where we were coming from,...","date":"October 6, 2022","imgURL":"","contents":[{"type":"text","data":"Before we jump in on today's topic, I want to quickly follow up on last week's hotly debated \"screwdriver color\" conversation.\nSome of y'all got where we were coming from, but a lot of people were pretty upset by the last-minute change.\nWe heard you.\nAnd while we still think we made the right decision, we understand that it's a decision that let a lot of people down who had been hyped on this product for a long time.\nSo... we're gonna meet you halfway.\nSilver is still the right call for longevity. There is no argument about that. But at launch, we're going to offer 2 shaft options - black or silver.\nIf you don't mind (or even like) the wear on the black shaft, then we're happy to provide that option for you. But we want to be clear up front that aesthetic wear on the black coating will not be a suitable reason to get a replacement through our support team. (We will obviously support any other type of manufacturing defect or in-spec failure, you can count on that!)\nSo there it is. When we launch, we'll have two options. But we will remove the black shaft option after a short period of time - so if you really want that one, make sure you're ready to buy when we launch!\nAnyway... on to a new topic for this week :D\nOutside of the projects you're aware of already, our engineering team has been focusing on some innovations in the realm of home office improvements."},{"type":"text","data":"Tynan Stack\nFully extruded Mechatronics Engineer"},{"type":"text","data":"Linus is a man with high expectations. His vision for\nlttstore.com strives to be environmentally conscious, functional, and aesthetically pleasing in every project we take on. And these expectations recently came to a head in a wall art project I've been working on.\nThe early pitch was pretty simple - we wanted to use lumber as an easy to assemble and sustainable frame... But as the project progressed, we wound up running into some issues with the consistency, supply, and of course recently sky-high cost of lumber.\nAfter chatting with several suppliers of lumber and moulding - the crown kind, that is - we realized that we would be limited to either plywood or MDF... Both of which are chock full of glues and other materials that make the 3 R's (Reduce, Reuse, Recycle) quite difficult. Not to mention they may not be strong enough for what we want to do…\nWe were starting to lose hope... but then an unlikely hero popped up. Could PLASTIC be cheaper, simpler to use, AND easier on the environment than our lumber solution??\nI reached out to a local plastic extrusion manufacturer about some of our smaller parts and their response exceeded my expectations... Not only could the parts be made from a recyclable plastic, but there was a possibility that they could use 100% reground (effectively recycled from existing manufactured plastics) material!\nAfter a bit of iteration, we modified the wooden panel design to work with plastic extrusion, giving us a stronger and more consistent product with a surprisingly similar weight to our wooden prototypes."},{"type":"image","data":"https://ci5.googleusercontent.com/proxy/uhmxxabj_6XU6jNuwYPAEihb5ds4OR3y4ijw49vZVTlfnT0GTAHn230GIstjVR9MGj1RZ5XWiMoqoqQ0y_ghn2uwQIxvVmoTvuNrtKzO-xQrJ3Wn0aL5uG6fTJ27Nbol1RgIms884UPMR5myxVRSjBuvDsH98LbpZD71YE9InWDuqO5Hh_bnMDSLpeEgfFtrT1fdgwwFR_kE3_B5YQC-f27H_5o=s0-d-e1-ft#https://cdn.shopify.com/shopify-email/variants/65bozg4db733d13z44nvjdn27h8k/f7f6c80e61690d71746c721bd14efbc0557e6839079f6b6fe3dab81b3c2bfb61.png"},{"type":"text","data":"Overview of an extrusion machine"},{"type":"image","data":"https://ci3.googleusercontent.com/proxy/9XuiUjQ1CMqbE1DagAK2hopoNRr_AvQhKIUdeNXf2PwSx_0bS8s2lJWRiG9rtzOpEA-psqwpPaGzn4JxFyEIjQSTQZNcJn3nDxqUwf9mr2uWgfm5Ie0JkPd-qzizJuVMT742ZH2cFvokePZELos18e9cNOoTyJtsuiT9wgGyYUFl1Cyapx01Rk4jAMyYFxUcOcoCC21Ksghz_XKxSNe_zPvJbr0=s0-d-e1-ft#https://cdn.shopify.com/shopify-email/variants/vaa5h9gdi1fppsz3vpzu1w9teblp/f7f6c80e61690d71746c721bd14efbc0557e6839079f6b6fe3dab81b3c2bfb61.png"},{"type":"text","data":"If you've never heard of extruding plastic before, the TL;DR is that it's a pretty significant manufacturing process.\nIt involves depositing your material into a hopper which feeds into the main barrel and the extrudsion screw. As the screw spins it forces the material down the barrel, increasing the heat and pressure of the plastic until it melts (sometimes with the help of external heaters).\nAs the screw comes to its end the plastic is forced through a filter screen/breaker plate and adapter plates, making the plastic smaller and smaller until it becomes the approximate size of the finished part.\nAt this point the process diverges depending on what you're trying to make - for our purposes, we're only covering extruding solid parts.\nTo form the shape of the plastic part, the final extursion stage forces it through a die - and, if your part has a hollow section inside, a mandrel is used as well.\nBelow you can see some examples of mandrels and dies that would form circular extruded pipes. The dies form the outer shape of the pipe, and the plastic is forced around the outside of the mandrel creating the hollow interior - sometimes with the help of compressed air to keep the hollow section open."},{"type":"image","data":"https://ci4.googleusercontent.com/proxy/ml0EYejmb5zy44Wi47BxPPbImjBHk3Ux7YzxtujBykzyuhRSyTZlQXVUHWLQjlDN6sDger231kSgTl1YTaIGsXtNUcPtVaGEzQ7Z_LEWa6lcxCtpZSu7XqEr3tFtBo9NeQEjix7Ca1xzGlf1mUkWQrr5dbdc_G0tiP34WNsbIxf-0xadM7S7PxkY5Oh30nEZ5R4Qehe1EZYZOUjtWdrKjhyFGH0=s0-d-e1-ft#https://cdn.shopify.com/shopify-email/variants/ir9eqwqb4xjowpb0q1xw5qlwl6zx/f7f6c80e61690d71746c721bd14efbc0557e6839079f6b6fe3dab81b3c2bfb61.png"},{"type":"text","data":"Source:\nhttps://ams-plasticextrusions.\ncom/pages/extrusion-tooling"},{"type":"text","data":"If needed, the part passes through a vacuum chamber which has small holes in its outer wall, allowing for the extruded part to be held against the wall and leading to tighter tolerances. This stage can be skipped for less involved parts.\nAfter that, it's moved directly into a cooling bath full of water to bring the plastic down to around room temperature."},{"type":"image","data":"https://ci6.googleusercontent.com/proxy/pLvkJZCf89k4WnwEUHnSqRXl0fiEbNObcH029NmsJNvuwJYdweFM94Lbr151FY9xFYUf0xbt1alp1ry_HL-KCYm0TtZs695Cw0PZgs65eLjOmnvdy8xMUQO6D8EeNCHF-9xw9nKliZ-6-SlJuJ8DriO2QLXZNzXR54h-MqReR5usImOMKbrYj3bO2oDh9aZAG_GBQUcmVjIJ7ic1iY7mEX18xqU=s0-d-e1-ft#https://cdn.shopify.com/shopify-email/variants/uvesvw0ikwe944gx29882hd8jnjs/f7f6c80e61690d71746c721bd14efbc0557e6839079f6b6fe3dab81b3c2bfb61.png"},{"type":"image","data":"https://ci6.googleusercontent.com/proxy/Q0SX9bt60atrk1x0yomD-E1TT4fslD4bXcHa8VVI_kYS2rx1BmPGxPg1zpg0-nat8jbOssfhminfSP3V45H3YU27eQ17HOQ7lv7mtVuPbx7dkM8h6BLFLy0xUzWYdb61tsByt7v5GnQMit-pKwmGCU9tfLKK34J5_156T36qIoso7VFTLkQ1KTrK8sGWjqjtrAbbabk7JmTTr4XhVZkozVztwro=s0-d-e1-ft#https://cdn.shopify.com/shopify-email/variants/qxx0d9ei05iixoiamfj60aa1iz7q/f7f6c80e61690d71746c721bd14efbc0557e6839079f6b6fe3dab81b3c2bfb61.png"},{"type":"text","data":"Throughout the whole process, there's a puller beyond the cooling bath setting the proper tension to reach the desired size of the final part. And depending on what the part is, it's either cut or spooled to be packed for a customer.\nSo to summarize... why extrusion?\n- Any waste material from production can be re-ground and used for future runs, rather than sent off to the dump or burned like wood scraps\n- It provides a suitably rigid final product for our upcoming project\n- It doesn't cost an arm and a leg!"},{"type":"text","data":"Dang. That's a lot of knowledge. We've got a ton of new stuff on the horizon, so keep an eye out for that...\nAnd something that we can talk about NOW is that we finally have our ShortCircuit hoodies ready for primetime!! We know a lot of people have been asking about these, and we are stoked to finally offer them on the store.\nThanks and speak with ya again soon!"},{"type":"text","data":"Nick\nCOO\nlttstore.com / Creator Warehouse\n@nicklmg"}]},{"path":"/blogs/the-newsletter-archive/things-are-changing","heading":"Things are changing","cardText":"Who would've thought that making a ratcheting screwdriver would be so darn difficult? It's been a massive journey... but we're almost at the end. Kyle has an update to share...","date":"October 6, 2022","imgURL":"https://www.lttstore.com/cdn/shop/articles/unnamed_4.jpg","contents":[{"type":"text","data":"Who would've thought that making a ratcheting screwdriver would be so darn difficult?\nIt's been a massive journey... but we're almost at the end. Kyle has an update to share about one of the FINAL changes we're making before production. It's a big one, but it's the right one..."},{"type":"text","data":"Kyle Tharratt\nEngineering Manager with a firm, silver shaft"},{"type":"text","data":"The screwdriver shaft will be silver... not black.\n*the crowd gasps*\nI know, I know... it's different.\nWe do a lot of internal testing before releasing a product, and no product has undergone more of it than our screwdriver. I've personally assembled, disassembled, and reassembled various versions of the screwdriver over 200 times in the last 2 years. My desk is littered with various prototypes, parts, and failed implementations.\nAs soon as it was possible, we’ve had multiple drivers in the hands of our engineers, our writers, and Linus himself. We have been daily driving this thing for months, because we wanted it to be perfect before anyone outside of LMG got hands on with it.\nAnd through this journey, we've had to make some tough decisions. I recently received a round of prototype units back from Linus & the team, and one thing became incredibly obvious - the beautiful black chrome finish on our screwdriver shaft has not held up to the use that the rest of our driver excels in. Here's a quick comparison of some brand new or lightly used shafts on the left, and some medium- and well-worn shafts on the right."},{"type":"image","data":"https://ci3.googleusercontent.com/proxy/uYXOKfNbWk5Z6Hnp0pczGhOqTsPQRSXkobGemyFp149JwHu5SjiThejLyuZ1B3XBPm_tgjNod9iHKt2InNKsk-gg7AN7Fv9dKSntEBaWmkLeH7d2m8lIJYieXZsMjG3Y-yAECgJUE0C0KXJ9QTxDdqvb4dC-4wY-cJZQaLry73F6MjoGCTmZ8u1jPY4L5NxiGMSBwRcDMFaynU3TxRxUcdVUXjw=s0-d-e1-ft#https://cdn.shopify.com/shopify-email/variants/h5opny1iog51mwgcvejompcr6yq5/d1ea4c47ba48571d6311ce650124e73f54f74a3b573b4793f695c1282de0554c.jpg"},{"type":"text","data":"I don't want to break out any metallurgy textbooks, so we'll keep the conversation pretty simple. The only way to make a stainless-steel shaft black is to coat it, as steel is inherently silver in color.\nCoating has a few issues. The biggest one being that when you damage the surface finish, you lose the applied color - exactly like scratching the paint on a black car, or getting water on your satin wall paint (shoutout to all the eggshell lovers out there).\nThis damage is purely aesthetic, but it does expose the uncoated silver stainless steel underneath. With a black coating, the contrast with silver is stark, and it leaves the driver looking a bit cheap and worn out if you're giving it the daily use that we hope you will.\nAs of this week, we've overcome the final challenges we had before production. This thing feels, and looks, f*cking awesome. We are days away from giving the final approval for production, and this was our last decision to make... do we go with the black chrome, which looks FANTASTIC on day 1 but wears away through normal use, or switch to the standard silver stainless, which also looks great and will look just as good after months or years of normal use?\nEven if we don't prefer it aesthetically, the decision is obvious. This product is built to last. We want it to be your go-to ratcheting driver for years and years to come, and it needs to look the part in 5 years just as much as it does when you unbox it. As great as the black chrome looks on day 1, it doesn't align with that primary goal of longevity.\nSo that's it. It's final.\nThis is the LTT Screwdriver."},{"type":"image","data":"https://ci5.googleusercontent.com/proxy/hkjuMdsk2RBwOftIDLOAXClwd8RvFBapaZpdv8_i8qniTaHs3alVWAjcmRIYXfPTImyJBHfhbV1jCRSrspCKrf0rBgBkBHUwVyXx89ACfRpRGeh6fIRSs1F2zPjNEHY9i9aIS3SQMHAzP3zuRKtv_zrv09WM7PmXt9jBsufugfC3DiEkIMXoXZk-JcE7XjatkWpV6BtG3kovT5p1GVPraREn2qc=s0-d-e1-ft#https://cdn.shopify.com/shopify-email/variants/jo22byf2lz4djh1hx7fpods6au0d/f7f6c80e61690d71746c721bd14efbc0557e6839079f6b6fe3dab81b3c2bfb61.png"},{"type":"text","data":"And it looks DAMN good. This was a tough choice, but it's the right one.\nWithin the next few months, you'll hear a lot more about this screwdriver. We said it'd be out in summer, and right now it looks like we'll be able to stick to that.\nMake sure you sign up for a notification below if you haven't already. That way you can be one of the first people in the world to get an order in as soon as it's available.\nAnd keep an eye out for more info... maybe there will be an opportunity to get hands on with one in person here in Vancouver before the rest of the world sees it... or maybe I'm lying... I guess you'll have to wait to find out...\nOh, and buy a Party Shirt. They're frickin awesome.\nBYE! &lt;3"},{"type":"text","data":"Nick\nCOO\nlttstore.com / Creator Warehouse\n@nicklmg"}]},{"path":"/blogs/the-newsletter-archive/were-back-and-more-shielded-than-ever","heading":"We're back and more shielded than ever","cardText":"Happy 2022 y'all! We've had a busy start to the year, with a LOT of time spent researching (see: destroying) some samples to get us in a good place on...","date":"October 6, 2022","imgURL":"https://www.lttstore.com/cdn/shop/articles/unnamed_3.jpg","contents":[{"type":"text","data":"Happy 2022 y'all! We've had a busy start to the year, with a LOT of time spent researching (see: destroying) some samples to get us in a good place on new projects... and oh boy, does Kyle have a story for you!\nIf you haven't seen our recent LTT videos featuring our new cable tester, they are definitely recommended (though not required) viewing to boost your understanding of some of the concepts outlined in this update.\nhttps://youtu.be/u6lx1ntNoxE\nhttps://youtu.be/XFbJD6RE4EY\nhttps://youtu.be/Vn2vdQZhs0w"},{"type":"text","data":"Kyle Tharratt\nEngineering Manager whose shields are well-terminated"},{"type":"text","data":"It’s no secret that lttstore is planning to sell cables at some point. Our goal is to provide good quality cables that you can trust to “just work” and have easily understandable capabilities, freeing you from having to navigate ridiculous naming conventions and ever-changing specs – I’m looking at you, USB 3.2 gen 2x2 and HDMI 2.1.\nAnd there’s no better place to start than the do-it-all cable, the USB type-C 20Gbps with 100W Power Delivery (PD).\nWe ordered a bunch from the most recommended factories (or at least the most recommended factories who would deal with us without any sort of existing large order quantity), ran them though our cable tester, and…\nEVERY SINGLE CABLE FAILED SIGNAL INTEGRITY??\nSome failed so badly that they couldn’t even do 5Gbps! What a fantastic start…\nAt this point, there was only one thing to do… I pulled out a knife and a Dremel, and I went to town cracking open the housing on each cable.\nHere’s a look under the hood on one of the failed units:"},{"type":"image","data":"https://ci4.googleusercontent.com/proxy/i43pd2rXuaJ8DPFV3J8CHXqnf95-ZqWpgiEnm2GwHmjwBU5MS-I1QFmFABbadPJbDo_Bu32pkj54tQVgXvdW0yHk1RDm0BUwdhwDcv-WNnlPQfWwLGgqzZY7Q82LoOqnqwdEvTPAe4KQItZ4Czo7y8t_aA0nyoOaDL_7r_qoCRiACaDoNjDTUre23u8YfxODTy-hORvb7zQFl7nGH7J0xfjYLS0=s0-d-e1-ft#https://cdn.shopify.com/shopify-email/variants/cdorafa86b54y6smus1xkla2eta6/56bb704cb6cb0a0ab4246ad1fffa8b9979b8dab45168f56be4d5ddf3527f2684.jpg"},{"type":"text","data":"It’s a PCB with a SMT USB type C connecter on one end, an IC (called an emarker, mainly for PD negotiation), some MLCC caps, and the cable's conductors are soldered to the other end of the PCB.\nIf you’ve got some experience with high-speed signals, you may already see exactly what’s happening here…\nFor the uninitiated let’s take a quick look at the USB Type C cable spec - which is 373 pages long. Don’t worry, we only need one… page 75:"},{"type":"image","data":"https://ci5.googleusercontent.com/proxy/izeywiBqw2XyeX4oanVYKFmU56LHswHkob09cMuKDdx4cx88E1RHQx-ybuUZIb2MUgyu_Z6btefimTEcR1RzZEPBTW3bfc_9YCnWsiVM3e3D_iaiEDXdSUg8LZmiWqJRna2BuR4FCwltC0lrcBeNU77SdK6OTYjRVVfcfT5nreRAmA28G3ynWRQf1g8iFTgb_IBCIVTOKA9tUjkr7aB7VY5uNzs=s0-d-e1-ft#https://cdn.shopify.com/shopify-email/variants/gg9n3s2r7i6b9yeq4b6fdwrucuc5/51cd02b8b10742afe0420f340d7c871f97ce68e7c4e107c784a4aaa02e05f4cb.png"},{"type":"text","data":"Note that SDP stands for Shielded Differential Pair and there are 4 pairs in total that form the high-speed lanes.\nAll of them failed signal integrity testing. All failing cables used a shielded twisted pair that had no drain wire, and NONE of the 5 cables’ shields were terminated to ground…\nNONE. Shields aren’t wireless people… this is like putting on an un-grounded ESD band and expecting the static to be magically absorbed.\nSo let’s find a perfectly working cable that passes all signal testing and destroy it - for science, obviously - to see what it looks like inside:"},{"type":"image","data":"https://ci4.googleusercontent.com/proxy/B4uAJ0i_CO635hJBcUDLaa0XgbbFy-iVRsc7-iv3_jBb_VCfYPlimf4bWhMcCFoV8Tr-ttG5Tky3ZUxExLNrRpRfg-OAyM5qfM7EUc8X-Td8OKgEgVs5pskBBhKeoT65n4NdWydIX-5ga7r8ht5ydJYmEbvFZY5CITolIquncNL5FkikZRw3dXDPT1xHYs3NMmY7YHulanyVfWp_gT00q75bR4I=s0-d-e1-ft#https://cdn.shopify.com/shopify-email/variants/5d0z9l0ztvyomfcawunjk8536jn0/56bb704cb6cb0a0ab4246ad1fffa8b9979b8dab45168f56be4d5ddf3527f2684.jpg"},{"type":"image","data":"https://ci5.googleusercontent.com/proxy/7aj5D54igLV1-zmAtk-eGfs28BopMkYgLyICGxIKV_nZa-2I7jPcDKO7PiS6qO5ojGMBtYpi52sNUiLqBbbQePFGPDxPwD-sq70UO-mBp3-cLvssYSmgL2tq8KFt0pCvYJ8tWYk62Jo2mYF7pnjFOV-CbdGaNNsuQBs3vjbCHELLvcsgtZv21VrBn714gamLd1Ti-AJZ4L7IviO2geAMjsKsWMQ=s0-d-e1-ft#https://cdn.shopify.com/shopify-email/variants/l6s3vai0951ckioinjyhuu6xkyxg/56bb704cb6cb0a0ab4246ad1fffa8b9979b8dab45168f56be4d5ddf3527f2684.jpg"},{"type":"image","data":"https://ci6.googleusercontent.com/proxy/7WdlRO1pmJTmJd_e6UeuFPBTEEdapgryNhlKrL35j_mhFv4WHNw_GVrdWSb-e4LzPBqhs_DVQAgY8dKHpB_9BFLHgo4jZYl1MJh_VjzRTRWOCPJFapsvCwBDddrt5yT8eH1Cx5j3t0yAKfWVwxq5J-SjRHRWC8BWPdTnouSPEG-ZygW6UQQmfHOXoGqW-3tSalUaFRM21SVzDf082Sx_3Ahi2wM=s0-d-e1-ft#https://cdn.shopify.com/shopify-email/variants/hxjbhi5flf82gl5nay65ixafg2bw/51cd02b8b10742afe0420f340d7c871f97ce68e7c4e107c784a4aaa02e05f4cb.png"},{"type":"text","data":"Breaking away the outer housing, we get a stamped sheet metal shield around the PCB - nice, none of the other cables had that! Removing this we get some over-molded plastic (gotta have that plastic protection baby) and then finally we get the PCB WITH FREAKIN TERMINATED SHIELDs (red arrows)!!! To further drive the point home, I cut open the cable and found one of the twisted pair high-speed lanes.\nGuess what… it had a drain wire with the twisted pair and all the drain wires are terminated correctly as well."},{"type":"image","data":"https://ci6.googleusercontent.com/proxy/BMw-a4g3aJjipwzMxIJUkcELWsoHYGU4qKa5T3k-BEZ9i63goV1AHpENDn4HcVtk2BFb929FWg0tdfdSgT87pu6CEJKTyEsPXBPd8ZUAQA7R1MI3bugCwnSjFJnwXo6p6UhKaDVd9LXs8rDykCeT4gdaw_Vmlr0pYgTsuk1oP17Goan_TDw-crHlEkPptq0lSsZPTzI6tVSG4Rbfhc8CoqcA1MM=s0-d-e1-ft#https://cdn.shopify.com/shopify-email/variants/0txipydvqqll7mlhmej8lvo2c15c/56bb704cb6cb0a0ab4246ad1fffa8b9979b8dab45168f56be4d5ddf3527f2684.jpg"},{"type":"text","data":"Its almost like following the spec\nactually makes a cable work… who would’ve thought.\nNow armed with this knowledge, would I be able to make the bad cables work by soldering the shields correctly with a soldering iron, some wire, and a can-do attitude? Short answer…\nNope.\nI soldered the outer cable shield to the connector housing, and lo and behold I got some previously failed parts of the test to pass - namely resistance tests.\nSignal integrity on the high-speed lines still sucked, probably because each of those lines have their own shield and, of course, it was also left un-terminated.\nTrying to solder the high-speed lines didn’t really work as the flimsy shield just shriveled and melted. (I also accidently severed 2 of the lanes with my knife and didn’t feel like spending more time redoing this on a different cable :P )\nI am guessing here, but it probably takes at least 3-5 extra manufacturing steps as well as extra material cost for twisted pairs with drain wire to make the cable that worked. And I suppose some manufacturers just choose not to do it to save a buck.\nRest assured, we will find working cables for the store. But in the meantime we might have another project for the LTT team to take on with our cable tester.\nLet us know on Twitter @Linustech - or on the LTT forum - if you wanna see some further investigation on this topic!"},{"type":"text","data":"As always, we're hard at work on projects like this. If you want to show your support to these efforts, we just added a classic Canadian-designed Plaid Flannel to the store, and we've got some restocks in popular styles like the WAN Hoodie! Keep an eye out for more updates coming soon."},{"type":"text","data":"Nick\nCOO\nlttstore.com / Creator Warehouse\n@nicklmg"}]},{"path":"/blogs/the-newsletter-archive/youre-rubbing-off-on-me","heading":"You're rubbing off on me!","cardText":"Oh yeah it's newsletter time again!! This week we have the one and only Bridget, our Fashion Designer, breaking down a pretty common theme in a lot of clothing manufacturing...","date":"October 6, 2022","imgURL":"https://www.lttstore.com/cdn/shop/articles/unnamed_2.jpg","contents":[{"type":"text","data":"Oh yeah it's newsletter time again!! This week we have the one and only Bridget, our Fashion Designer, breaking down a pretty common theme in a lot of clothing manufacturing - Color Fastness and the challenges of making incredible multi-colored garments."},{"type":"text","data":"Bridget Bergman\nFashion designer in pursuit of unfaded textiles"},{"type":"text","data":"We’ve got a TON of styles in the works right now - some are similar to what you’ve seen from us this year like WAN Hoodie and Swacket, and others are a bit more “mainstream,” including a whole line-up of color block hoodies.\nLloyd originally designed a set of colorblocks to match the color palettes of each of our main channels - LTT, TechQuickie, TechLinked, and ShortCircuit - and I’ve been working with our WAN Hoodie supplier to make these a reality."},{"type":"image","data":"https://ci5.googleusercontent.com/proxy/quNNu6BgqWXMfZvmeV1-ZWo4sFPc04Vg6Np5EiltRq84RguDGANan_5Vi5ORlFUy6pGPC14ha6t0ojvVkq08yb4W-yeenZgh_swk4JOUDfhwIGbDqqOGwXYwS9OUhO6E4enX6pvRZ3tmt0Xgu-WDz_IRS_f6i_MselRsAbiCdXpVY2fO3v2kiaoCRFzbbmh0HsSUeMsztqsRivxJRxV7ULplCSc=s0-d-e1-ft#https://cdn.shopify.com/shopify-email/variants/kgp6i9gie7u78lxaknpoehqqem40/56bb704cb6cb0a0ab4246ad1fffa8b9979b8dab45168f56be4d5ddf3527f2684.jpg"},{"type":"text","data":"We love the look of the styles and the feel of the fabric, but we’ve run into a familiar problem that often comes up with this type of color blocking… the contrasting colors are rubbing off on each other when washed."},{"type":"image","data":"https://ci6.googleusercontent.com/proxy/h7_O061e_pXXVsYHNvj9TXbCC9xCV_fhmbRjf738-AsHlfwRsJtffoVKZvyl10FKPp7uoPGKEukV0YgosVeFgZjqAfONFTa-pv6E8VDB55gqkWhJpMfo4r58pgGhrdnUP7cJBO3dp88Np_wBUsLnm8SkQGQVH-uYXdk7fTPxi9y3WbFZ0U4BOCFonuHaTzmuevDD_XicGKU6k2h7QpPSh3us0qE=s0-d-e1-ft#https://cdn.shopify.com/shopify-email/variants/f1duopl6nwg26j7cjxdo1nktaivj/51cd02b8b10742afe0420f340d7c871f97ce68e7c4e107c784a4aaa02e05f4cb.png"},{"type":"text","data":"Let’s quickly define a couple terms. “\nColor fastness” is a description of how well a material’s color resists change - so if a fabric has low color fastness, it’s likely that that fabric’s color will rub off on other materials, your skin, or other surfaces. “\nCrocking” is the industry term for what we’re seeing with these hoodies, where the color from one material is rubbing off on other materials around it. If you’ve ever worn a pair of brand new jeans before washing them, you’ve probably experienced some crocking in your life.\nMany different things can impact a material’s color fastness like the type of fiber, the type of dye, color choice, and the way that the dyed fabric is finished.\nYou may have seen washing instructions on some clothes like “wash with like colors.” When you see that, you can safely assume that the manufacturer is using a dyed fabric that is either too difficult - or too expensive - to improve when it comes to color fastness.\nWith our color block hoodie, we’re using a 100% cotton fabric and we’ve designed it with multiple fun, bright & dark colors right next to each other. We’re working with the mill and manufacturer to add a special dying agent which should significantly increase the color fastness of these garments beyond what we’ve seen on our samples. So unless there’s a\nvery good reason for it, you should never see this type of fastness issue on a finished garment from lttstore.\nAs with most things, it’s always important to follow instructions. If your pants say wash with like colors, or your graphic tee says hang to dry, you should always assume that the intent behind those instructions is to maintain the look and quality of the garment. Colors can run, artwork can peel or crack, or your Large hoodie could come out of the dryer as a Small. It can be a pain at times, but we (and most manufacturers) run a ton of tests on our garments before production to ensure that they look just as good on wear #100 as they did on wear #1."},{"type":"text","data":"If you don't want to wait for us to resolve these issues with our color block hoodies, we actually just launched our new Indoor Hoodie, which is perfect for lounge sessions or gaming over the holidays. We've got pretty limited quantities available in this first run, so grab one now if you're interested!"},{"type":"text","data":"Nick\nCOO\nlttstore.com / Creator Warehouse\n@nicklmg"}]},{"path":"/blogs/the-newsletter-archive/this-was-a-big-problem-for-us","heading":"This was a BIG problem for us...","cardText":"Creating the perfect LTT Screwdriver has not been easy... and unfortunately it is not quite done yet. We'll have more info about a release date in 2022, but to keep y'all up...","date":"October 6, 2022","imgURL":"https://www.lttstore.com/cdn/shop/articles/unnamed_2.png","contents":[{"type":"text","data":"Creating the perfect LTT Screwdriver has not been easy... and unfortunately it is not\nquite done yet.\nWe'll have more info about a release date in 2022, but to keep y'all up to date Kyle wanted to give some insight into one of the biggest recent challenges we've had with our injection molding process."},{"type":"text","data":"Kyle Tharratt\nWell-vented Manufacturing Engineer"},{"type":"text","data":"The road to releasing the LTT screwdriver has been a long one and we continue to face various challenges, most recently being a minor failure in one of our injection molds. Basically, one of our vents got plugged partway through a production run of our bit clips, causing some minor cosmetic defects."},{"type":"image","data":"https://ci3.googleusercontent.com/proxy/IelKLXkBtm3I-uS5EHniLbT2lE72lPpoKXXt4UVKVIbLGJLRBKaW7oZOZGBUM9o01DJtmqq9Fg6kYQrs8gZZBBsTqZ0-lgdDY4iTd_HIjO6rgjPxXJj0mBLs3AIVGHDsFVtodb3NxKkKT7SY0-X-8KvJr8tB51tSw4SOo7y1zUk-Z99y4pudM_gXSSqwtqbSs_03YXMH_g_Kqjl2m-wswUdHbTQ=s0-d-e1-ft#https://cdn.shopify.com/shopify-email/variants/ivrkqhopf9fz2rwroenbjao72j04/51cd02b8b10742afe0420f340d7c871f97ce68e7c4e107c784a4aaa02e05f4cb.png"},{"type":"text","data":"Before I explain exactly what happened, let’s do a quick & dirty rundown of injection molding. If you want some visuals to get a more clear understanding, check out this breakdown on Aire Plastics' site:\nhttps://www.aireplastics.com/\nbasic-injection-molding-\nprocess/ (we have no affiliation with them at all, we just thought their diagram was pretty informative).\nAs the name suggests, injection molding is the process of injecting molten thermo plastic into a mold to form a plastic part. In its simplest form, two halves of a mold are precisely carved, and in production are pressed together to form the cavity which is filled with plastic. Once cooled to a point that it will hold its shape but not stick to the mold or the ejector pin, the part is ejected. While there are a variety of factors that go into making a “good” part (each one could probably be a topic for a full newsletter itself...) we only had an issue with one aspect of this mold - venting.\nBasic laws of physics state that two objects can’t occupy the same space at the same time. When plastic gets injected into the cavity of a mold, the air that's in that cavity has to go somewhere, so mold makers have to build in a way for air to exit from the cavity of a mold through EXTREMELY small vents. And when we say extremely small, we're talking about as small as one or a few\nTHOUSANDTHS of an inch.\nImproper venting (or in our case the total failure of a vent) can cause issues ranging from minor cosmetic defects all the way to structural failures in a part. This is a result of air - which would have otherwise been removed - remaining in the mold while the plastic solidifies. This picture from\necomolding.com illustrates this perfectly."},{"type":"image","data":"https://ci5.googleusercontent.com/proxy/ztErrDdICZLHPvImR0O5xk0tqhF5M9wESgfVU396ATFUlSz-9bnHT6evEMtU6jkPSR9gcEeIrkSMnmFENKE8-9d_3UfTh-vyI6aOI0N0r7tiZr0DtwxsWgWgOrqdviiLlw7oItxx_KNwBYk4jj9fVd_M3BFyK7w3fIJZg7DNMp6Z2rDQeP3v_BkpmK9xVg_AuE9dd5YhgAUPOBAokEHsxUxtAuA=s0-d-e1-ft#https://cdn.shopify.com/shopify-email/variants/a9c474bcmsp45xqw12vxvg32362o/51cd02b8b10742afe0420f340d7c871f97ce68e7c4e107c784a4aaa02e05f4cb.png"},{"type":"text","data":"In our case, the resulting defect was so minor that most people would never notice it. But when you're looking at these parts as closely as we are, it's a pretty obvious issue. When we saw the defects, we knew we had to fix the mold and re-make those parts before we would be happy releasing this product to all of you.\nLuckily, most of the defect parts are a single color and haven't been over-molded or assembled with any other type of material, so they can be recycled (ground up and used for new injection molded parts in the future). There are a bunch of sub-assemblies that were put together, and we plan to find a way to use those in the future in final screwdrivers - maybe we'll keep them for internal use here at the office, or sell them as an \"imperfect\" version of the screwdriver through lttstore.\nObviously that would come with a pretty significant discount if we did offer it. And, as always, if we do wind up doing something like that, reading our future newsletters will be the best place to find out about it."},{"type":"text","data":"Hopefully that gives you a bit of insight on just one of the many challenging parts of creating something like the LTT Screwdriver. Our team is hard at work on this and\nmany other super cool items.\n2022 is gonna be an absolutely huge year for lttstore, and LMG as a whole. We're glad to have y'all here for the ride."},{"type":"text","data":"Nick\nCOO\nlttstore.com / Creator Warehouse\n@nicklmg"}]},{"path":"/blogs/the-newsletter-archive/were-all-a-bit-different","heading":"We're all a bit different...","cardText":"It's hard to believe just how complex the process of choosing a fabric can be. Material, blend, color, weight (measured in GSM or grams per square meter of fabric), interior...","date":"October 6, 2022","imgURL":"","contents":[{"type":"text","data":"It's hard to believe just how complex the process of choosing a fabric can be. Material, blend, color, weight (measured in GSM or grams per square meter of fabric), interior finish, exterior finish, and so many other factors... it can get a bit confusing, to say the least.\nUnderstanding fabric differences and style differences can be a bit of an arduous process, but we want to make that a bit easier by laying out one of the primary differences you'll find on lttstore hoodies - whether the fabric is french terry or brushed fleece.\nAnd there is no one I would trust more to explain that difference than our Fashion Designer, Bridget."},{"type":"text","data":"Bridget Bergman\nFashion Designer & fabrics aficionado"},{"type":"text","data":"At Creator Warehouse, we're working on a TON of new styles right now - especially with hoodies. One of the biggest differences you'll find between some of our offerings is whether there is a french terry or brushed fleece backing inside the hoodie.\nFrench terry is a jersey fabric (basically just a knit fabric which is soft and stretchy, like a t-shirt) with loops of yarn on the inside. Garments with french terry are usually seen as a bit more functional since the terry gives them a more light weight and breathable feel than you'd find with brushed fleece. French terry fabrics are still super comfy, but typically don't feel as heavy as a full brushed fleece, and feature more moisture wicking capability. It's comfortable, plush, soft, and great for loungewear and basics - which is why we went with french terry for the WAN hoodie and a few other upcoming garments."},{"type":"image","data":"https://ci3.googleusercontent.com/proxy/2uJidwbd8uvKyVDF_BSgZipyCciUeBT8Dm4nabuIi3lGni6jHsUW2AWa8iPpk741-gb6Cg_Ne8B_pdcYisUK4_6l28zrLThzI5a6H-TzOxq6fdopExlf4KQTCH_60MpByw_3gLqhVGkNLDF-0D1U-Ml3RvCKZyh1lCJQe4eosd4QmzUfChnebw-XXU-1tqdg9X2GNNvbq1xORzON-8thmjBF6y0=s0-d-e1-ft#https://cdn.shopify.com/shopify-email/variants/cx6zess1d4mn9wveq859r4w40sm1/9690427bc4b5f2095758aae0d45bb574f769bf1e6b9e18367fdb6f7e0486883d.jpg"},{"type":"text","data":"Brushed fleece - sometimes just referred to as \"sweatshirt fleece\" - is similar to french terry in that it has a smooth jersey face with loops of yarn on the inside,\nbut after the fabric is woven these loops are shredded and cut up in manufacturing. That's what creates that soft fuzzy fleece that many people absolutely love in sweatshirts. It is generally warmer than french terry and feels soft and cozy against skin, but can definitely feel a bit heavier - especially when wet. It's a great choice if your biggest goal with a garment is ultimate comfort & coziness."},{"type":"image","data":"https://ci3.googleusercontent.com/proxy/83UFeAqZSsLUfywQDay9njX_3RmJo7AzbTNNkhEbi_JLodP0j2pSqMnw_esQiuMh3f-AnZvltNu5z74-JS24B2eBlX9-c3BTHY-O9t70GiHUCR2cCdyrl6Ok2v7NkEJNYMZCfgq8MZc1S3curXtde7ZCIW5T9H7ups1n6hO2issZFBS5E9A8QvyNOeyx7EHy0kTtV4_OkW_xF1T5or4C6IO_G8I=s0-d-e1-ft#https://cdn.shopify.com/shopify-email/variants/3tcn8wq5b3hqx8i7hh3a9nroj9lb/9690427bc4b5f2095758aae0d45bb574f769bf1e6b9e18367fdb6f7e0486883d.jpg"},{"type":"text","data":"Both fabrics are easy to wash and wear, and can be worn comfortably everyday. The biggest factor to consider is - like many things - personal preference. Some of our internal testers love the french terry functional feeling, and others love the warmth of fleece. We've definitely got some offerings in both varieties coming soon, so keep your eye on lttstore for more updates as we move into 2022!"},{"type":"text","data":"Heck yeah. We've definitely got a lot of new garments coming down the pipeline, and we should have some big store changes coming next year as well... so expect to see a lot more info on each product page which will help you make the right decisions on what styles and sizes YOU want when picking stuff on lttstore."},{"type":"text","data":"Nick\nCOO\nlttstore.com / Creator Warehouse\n@nicklmg"}]},{"path":"/blogs/the-newsletter-archive/more-free-items-in-2022","heading":"More free items in 2022??","cardText":"For most of lttstore.com's life, we've offered a free sticker pack with every order (while supplies last). And of course, that tradition is continuing into 2022. Here's a sneak peek of...","date":"October 6, 2022","imgURL":"https://www.lttstore.com/cdn/shop/articles/unnamed_1.png","contents":[]},{"path":"/blogs/the-newsletter-archive/thats-no-moon-its-a-space-station","heading":"That's no moon. It's a space station...","cardText":"Not everything that our team works on is directly related to making something that you might hold in your hands one day. There’s a lot of testing and analysis that...","date":"October 6, 2022","imgURL":"https://www.lttstore.com/cdn/shop/articles/unnamed_1.jpg","contents":[{"type":"text","data":"Not everything that our team works on is directly related to making something that you might hold in your hands one day. There’s a lot of testing and analysis that goes on behind the scenes, and a lot of that starts out with certifying that a product will do what we say it should, but quickly evolves into a much more general application.\nKyle’s omnidirectional speaker is a perfect example."},{"type":"text","data":"Kyle Tharratt\nManufacturing engineer & professional crab raver"},{"type":"text","data":"Regular viewers of our Short Circuit channel would know that when we built the new set our videos suffered from pretty bad echo/reverberation. Most times, this is a HUGE headache that requires a lot of work installing sound deadening and modifying the space… but in this case, the fix was simple - just move the microphone, dawg.\nHow did we figure this out? Science!"},{"type":"image","data":"https://ci6.googleusercontent.com/proxy/12tzDL2VO8gfjlEtjlcHFBvW2aR88pgq4bkWMyi2gUCuO3TU82qVQ0Gh2VZN2i1Ud5-2MTpz2nd18BXtRP0gNFRVaTCchY3oY1d5LE-F6U1qATYqo6Wmon3PR9voCvfxzP59tKUuQP9cYqlacL7JCOLK912eBzRPix7crfvsNVazLvYapsvwK0wlJg4Ek3J8gpi3czL3L9IhkcVck2yQRFZJ2qE=s0-d-e1-ft#https://cdn.shopify.com/shopify-email/variants/d30xdo8jyfyilbwu5n2ohf0nzeez/56bb704cb6cb0a0ab4246ad1fffa8b9979b8dab45168f56be4d5ddf3527f2684.jpg"},{"type":"text","data":"We call it the death star speaker and it has one single function… to make noise in all directions. It was built mostly by following an instructable on A Dodecahedron Speaker for Desktop Printers (\nhttps://www.instructables.com/\nA-Dodecahedron-Speaker-for-\nDesktop-Printers/ ) with the major differences being the addition of a tripod stand and using more readily available speakers.\nAfter a bunch of hours 3d printing, a day in the workshop and some jank of course… out came a working omni-directional sound maker. Combining this speaker with a calibrated USB microphone and an open-source software package called REW allows us to make relatively accurate acoustic readings.\nAs I alluded to earlier, we used this to help get rid of the reverb from the short circuit set, where we measured a significant reduction between two mic locations. You also saw this bad boy show up in the LTT video about acoustic treating the workshop. Without going too turbo nerd here, we basically used an RT60 reverb decay graph to show how the reverb lessened after adding treatment:"},{"type":"image","data":"https://ci5.googleusercontent.com/proxy/-MbbMwoZ7v1G9KLhhYXcbTWoOW2vLEYbFbtBrm0bTf0KaDoR7jZXQf3qBL9rjIcpD5Wer_BVqIncYLytucBI7LlToB9pBDhmhpKAErOMoJJLdpn71HlFMwjQ3kVQLwKDxQRKIYpq5Edw3fRJnhc0jG12AvmEE-qJZJjyrJmQMR-I0QLFeFmATI6jgTFDDR9J5sbL4X5uq6BKv6EYG8q-M8fxFQ4=s0-d-e1-ft#https://cdn.shopify.com/shopify-email/variants/1h6kl6olt84ymkq0io6zy9apu6y5/51cd02b8b10742afe0420f340d7c871f97ce68e7c4e107c784a4aaa02e05f4cb.png"},{"type":"text","data":"The purple line (pass 2) shows the result of just adding a few sound panels in the workshop. The decay became noticeably lower within human speaking range (125Hz - 8Khz)."},{"type":"image","data":"https://ci5.googleusercontent.com/proxy/polKyDou8j2UF-f_UIQiTBY3IBqo1yM3cLl8ilFny-p0VqakhM85F6Aa8hgyO3aFqrPQxCo9-jjArycsvveUjjjvPjEwVWwnOAmrhqatwEIppiKvx12jRpfA7fDTabLQi6bG8O2kHwizr6r0h7SZcym1WEV3i49vV0sycy7i6lA7gGhnqUeo2Zx-IZuohW9xYww5kTEW6_NQGz7-r3O3HuopTx8=s0-d-e1-ft#https://cdn.shopify.com/shopify-email/variants/1lojo6agw3e8gwu03mtnu91f3pkj/51cd02b8b10742afe0420f340d7c871f97ce68e7c4e107c784a4aaa02e05f4cb.png"},{"type":"text","data":"So, why did we put all these resources into something like this? Was it just for a cool video? Well yes, but also no. The overarching goal here is to start objectively quantifying some of the things that we experience. We want to make more of the choices about how we run our business - whether that’s evaluating a product or creating the ideal setup for a new set - based on a lot more data.\nStay tuned for more of this, as we are really looking to up our testing game in the coming months."},{"type":"text","data":"Heck yeah. I’m sure you’ll see a lot more about the random stuff we use to improve the office and measure our products soon.\nLet us know if you want Kyle to give a breakdown of the mouse tester he created to certify the accuracy of our desk pads in this video\nhttps://youtu.be/nLgXeIaK0U0"},{"type":"text","data":"Nick\nCOO\nlttstore.com / Creator Warehouse\n@nicklmg"}]},{"path":"/blogs/the-newsletter-archive/the-ones-we-didnt-release","heading":"The ones we DIDN'T release","cardText":"Colors… there’s a lot of them. And it turns out they’re one of the most important parts of basically every aspect of our business - lighting, editing, benchmarking, product development,...","date":"October 6, 2022","imgURL":"https://www.lttstore.com/cdn/shop/articles/unnamed.jpg","contents":[{"type":"text","data":"Colors… there’s a lot of them. And it turns out they’re one of the most important parts of basically every aspect of our business - lighting, editing, benchmarking, product development, graphic design, and of course fashion design."},{"type":"text","data":"I spend more time than I ever thought I would discussing whether this grey works better than that grey, or whether the gloss on a tag shines just the way that we expected it to. And at the end of the day, it’s a very worthwhile pursuit.\nBut of course, when it comes to advice on colors, I only trust the absolute best. You may know her as Agent Cashnickel, or “That ShortCircuit host with the infectious laugh,” but I know her as Sarah Butt, an absolute ace in color and graphics. Here’s some insight from Sarah on why we\nhaven’t chosen to work with some of the colors we’ve come across in our product development journey."},{"type":"text","data":"Sarah Butt\nGraphic Designer & Color Aficionado"},{"type":"text","data":"Color is always one of the most important elements of my projects - especially something like our Beanie collection.\nAs fun as picking colors can be, it can also be a bit tedious. We have to make sure that every color is versatile and can be worn with anything and by anyone, and we always want the colors in a set to complement each other as a collection.\nOur process involves a lot of ordering samples, waiting, getting approvals, making adjustments, and waiting once again. It takes a while to get to the final set you see today in our store.\nBut it’s pretty obvious why we’ve picked the ones you see in the store today… they’re versatile and were our top picks, not much more to say there. So here’s some insight on why we didn’t choose to go into production with 4 other colors that we chose in our sampling process."},{"type":"image","data":"https://ci5.googleusercontent.com/proxy/W7CK6ZJJz-tM8fvznngXDShGLJbeq4-IaLYkh2aYC7dXhxiFkUmWj9oRgPB8iOtFBmTAflmNuJkJZAbOkf9B4BnAWkHHTz8SP6WoQGNykyAJ7UeDWw8B1yCmB9QgDBflEO--EJgM1GPcv3cLwS9Ev4dAjKDdPz-rt-goTrnFYWWgQCSnD1BDk0KjMDLFHW1PnGRqm7Swp2KWWrzk23idn9bYS-s=s0-d-e1-ft#https://cdn.shopify.com/shopify-email/variants/mtk2pr3rhryaqqymmeogjokzxp6i/661d189cb8efb69e1effb7cd812f878859a2549fb31417576950ebaec637fb33.jpg"},{"type":"text","data":"Neutral tones are really popular right now but we had some concerns that this specific camel color didn’t complement a lot of skin tones very well. We try our best to make sure our products are as inclusive as possible, so this is always a significant consideration for us in the process, and this one just didn’t pass the test."},{"type":"image","data":"https://ci6.googleusercontent.com/proxy/9IyLh6xSAtvsuldSzZrC19V4WxUiejT0mOHVgNvj2pS0QoVmsDP_EI-a9SatnzsO4jRGFRDx6EyOQ20U2xenxCUCstYtxBZ1_a83lHGfkrmOjTGSoWJSYaqSJEsO1H_knaxzb24RXHMR6j1tEQivKCqETtoYpO9_R-_lTZg8M5VoP4jDrisxMjtNjDoObiIpa3xRwNjV9LVA9hLDjwANc1ZEhrc=s0-d-e1-ft#https://cdn.shopify.com/shopify-email/variants/5puv3hx8hnzxehht3muz1qmfl7hr/9690427bc4b5f2095758aae0d45bb574f769bf1e6b9e18367fdb6f7e0486883d.jpg"},{"type":"text","data":"This one was intended to match the LTT brand color (just in case you want to shout your support from the rooftops!). When we received the sample it was not quite comparable to the color we had requested... it was much more of a pink salmon than the red-orange we were expecting. This was definitely a case of the wool / acrylic blend not being capable of replicating the color that we saw on the 100% acrylic swatch, and unfortunately that’s just something that we often can’t control."},{"type":"image","data":"https://ci5.googleusercontent.com/proxy/oEgMDW0CN8YYYA-vJbcv_vDWCinJrfTz-JNxlYq88SdaicR6iCyDucd9tjLvFJjPiVrVIT4U3q2tFdXaCcZ7KcF0FSGxgte3WfTxBN6rBSc_pKOkbmK57oR3MNL-8aBCD0lMPeWgx5uQ8W8gFo3UKuFGsjpC62ol5ZA4c7gntFop3sNEQYrW7n0Ez6aFZJixlejyQehuA7a_08xWCScvxdSpqG4=s0-d-e1-ft#https://cdn.shopify.com/shopify-email/variants/hcs3pml2ucdwjp4gws9czdsek2wq/7776cc1f6f57988de9e7e19a1584f7c61669a75222dfc7eac111c36eef61c539.png"},{"type":"text","data":"We loved this purple and brown leather tag combo, but it was an unfortunate victim of circumstance. We had already decided that the 4 new colors we chose were more likely to appeal to a wider variety of people, so purple was put on the chopping block.\nWhat’s interesting is that this might have actually been a mistake on our part… the purple lanyards are INCREDIBLY popular, so it’s clear that there’s a big demand for it in the audience. You might see this one in a future drop :)"},{"type":"image","data":"https://ci3.googleusercontent.com/proxy/G8MXKYSQmbhqsP6Mwkd8YQ8HRmTbCFKu7Bw7knZRhMq8YL0A34StEoc_JK96MC0rYS0fM4SIXeIaSBMJu645w5lQzfKb3c365g0aG-eqaF0FTfSsMiSITFh965EvjslSZi9yQ7E_o267ojkeYTGRgYAh8BEwMJvSoi-J-Pni8t-BLPCB_LKV-QZwhIcjypBkUDsG12dJEqE_4ma8UleY3yeGRN4=s0-d-e1-ft#https://cdn.shopify.com/shopify-email/variants/y9az2lq2e7j53ty0rh6n01d8yfg1/7776cc1f6f57988de9e7e19a1584f7c61669a75222dfc7eac111c36eef61c539.png"},{"type":"text","data":"Just like that LED strip you bought on Aliexpress, this color just didn’t live up to our expectations. We had already picked the burgundy, and this was a close comparison, just… a bit uglier. When we saw all of our samples together, it was an obvious decision - burgundy was the way to go and this off-brown ginger got thrown into the “freebie” pile here at the office.\nThis color is great on other garments but it just didn’t work out here with the beanies."},{"type":"text","data":"Thanks Sarah!\nAnd if you want to get your hands on some colors that Sarah did pick, you can grab a beanie OR one (or 6?) of our brand new ShortCircuit “Banana for Scale” plushies, available in 6 awesome colors. You can pick up one for $9.99, or a pack of 6 of just over $40."},{"type":"text","data":"Thanks for checking in this week, and be on the lookout for some other awesome releases as we close out 2021\nNick\nCOO\nlttstore.com / Creator Warehouse\n@nicklmg"}]},{"path":"/blogs/the-newsletter-archive/we-tried-to-make-it-harder","heading":"We tried to make it harder...","cardText":"We have made a lot of tough choices about our screwdriver in the 2 years we’ve been building it. And no, I don’t have a release date for you yet… trust me,...","date":"October 6, 2022","imgURL":"https://www.lttstore.com/cdn/shop/articles/unnamed.png","contents":[{"type":"text","data":"We have made a\nlot of tough choices about our screwdriver in the 2 years we’ve been building it. And no, I don’t have a release date for you yet… trust me, we’re even more disappointed about that than you are… But as we near the finish line, I can start telling you a bit more about our process."},{"type":"image","data":"https://ci5.googleusercontent.com/proxy/ZdHrgVbb9OYCrtCysV3-2LRWcwfRXxGxbymzeuxtx_aZtp25r_7nmN_9IVJ6TUfkhfwNsdSP30_VAKh6toLfVjnscBwNUeKKDZ-kZzMfQ9oBJ5JoxtR0XokwnVk2ilNCPZ2tDlzJBjXRS8CRsf6a8gHSrDlO_hE5SQf94jygZsFOVbSeiztykjklJ9E_HSAST151t18A-JRzaHJ2enKe08RbeSw=s0-d-e1-ft#https://cdn.shopify.com/shopify-email/variants/0vra4g5relefc5p11nf7lsi63nve/51cd02b8b10742afe0420f340d7c871f97ce68e7c4e107c784a4aaa02e05f4cb.png"},{"type":"text","data":"Quality bits were a big focus for us. Colors, finishes, materials… we had a lot of questions for our production partners, and luckily they had\nmost of the answers.\nSomething we’ve always heard about was titanium-coated bits. On the surface, it feels a bit like “military-grade aluminum” and similar marketing nonsense, but we wanted to give it a try anyway. Because who doesn’t want flippin’ titanium bits in their screwdriver.\nAfter a bit of research, we found that they were MUCH more expensive than normal steel bits, which was expected... but what wasn’t expected is that they’re not actually that much more effective for our expected use case.\nAnyway, I’m just a business guy, so I asked Kyle - our lead engineer on the screwdriver project - to give you a breakdown of why you won’t see titanium bits in the LTT screwdriver. At least not in the v1…"},{"type":"text","data":"Kyle Tharratt\nManufacturing Engineer & Fixer of Broken Things"},{"type":"text","data":"“I want the strongest bits ever, we should do Titanium bits!” says Linus after savagely mangling a P2 pentalobe bit while trying to force open an innocent AirPods Max casing.\nSometimes this is how tasks at Creator Warehouse originate - Linus will break something and ask us to make it better.\nAnd of course, everyone knows that titanium is better than steel… right?\nWell, pure titanium is kind of useless for structural purposes and is normally alloyed in some way. It’s also pretty much impossible to find someone who would produce pure titanium bits (more like unobtanium bits...). Therefore most “titanium” bits you find in the wild are actually steel bits coated with something called titanium nitride, which gives them a gold finish."},{"type":"image","data":"https://ci4.googleusercontent.com/proxy/j2qgRoA9Oj2ggz9yTJRFglOoVyb_hccTk8i3dtlNVe6rj_TzSh5eErH9QA5SjGvMIZ62CjJTtbHgze8P27tsn_G-1ZEF8uOp1PLb36aS3888irmAAgRJoTd7gNgUFP4llT58YSZpPO6HmNjuY3gp_Q2C_IJg2ZRssyHOJJgWHgQmSfkL6i_LbmKZxHmvSC6-cVtTZvY0k0M4hITfxRe9R1FrVgQ=s0-d-e1-ft#https://cdn.shopify.com/shopify-email/variants/tza5v53h9c6f7zdba7zqmj1pnskt/cc84667e788b855dfa471f2b7c845f4f8226a9dd745c1a142004f84f30f704f4.png"},{"type":"text","data":"While this coating is technically slightly stronger than our S2 Tool Steel bits, it’s over half a million times thinner than the shank of even our smallest bit. What this means is that when you are screwing a screw, most of the force will still be borne by tool steel. In the end we felt that there was no real-world benefit to the 5x cost increase compared to S2, at least for screwdriver bits.\nOk… so why not just use stronger steel?\nWell, our bits actually\ndo use a different grade of steel than the one that Linus mangled.\nWithout going too much into the material science, while both bits are similar in toughness, S2 steel can take more force but is more brittle.\nIn other words, our bits are designed to hold their shape, up to the point at which they break.\nNow, hopefully you are not punishing the screws of your electronics so much that you end up breaking bits. But if you are, it’s better to break bits than to break screws."},{"type":"text","data":"So that’s that! You might see a titanium bit set from us down the line for those who just want to flex that wallet... but if you buy an LTT Screwdriver on day 1, you’ll get S2 Tool Steel bits in that bad boy.\nStay tuned for more info on the LTT Screwdriver in the coming months.\n-Nick Light\nCOO, Creator Warehouse /\nlttstore.com"}]}]